{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "F",
    "1": "E",
    "2": "D",
    "3": "H",
    "4": "L",
    "5": "M",
    "6": "S",
    "7": "K",
    "8": "O",
    "9": "V",
    "10": "X",
    "11": "N",
    "12": "Q",
    "13": "G",
    "14": "T",
    "15": "U",
    "16": "B",
    "17": "Y",
    "18": "A",
    "19": "W",
    "20": "R",
    "21": "P",
    "22": "C",
    "23": "I"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "A": 18,
    "B": 16,
    "C": 22,
    "D": 2,
    "E": 1,
    "F": 0,
    "G": 13,
    "H": 3,
    "I": 23,
    "K": 7,
    "L": 4,
    "M": 5,
    "N": 11,
    "O": 8,
    "P": 21,
    "Q": 12,
    "R": 20,
    "S": 6,
    "T": 14,
    "U": 15,
    "V": 9,
    "W": 19,
    "X": 10,
    "Y": 17
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.0"
}
